app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "今日も一日頑張るぞい！"], ["created_at", "2020-04-25 11:45:05.757291"], ["updated_at", "2020-04-25 11:45:05.757291"]]
---
  def create
    @post = Post.new(content: params[:content])
    if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 12]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    if @post.destroy