app/controllers/users_controller.rb

UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "rabbitrabbit2020"], ["updated_at", "2020-04-17 07:23:29.195585"], ["id", 3]]
---
  def update
   @user = User.find_by(id: params[:id])
   @user.name=params[:name]
   @user.email=params[:email]
   if @user.save

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]
---
 def destroy
   @user = User.find_by(id: params[:id])
   @user.destroy