app/controllers/users_controller.rb

  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      if params[:image]
        image_name: params[:image]
      else
        image_name:"tweeticon.png"
    )
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password") VALUES (?, ?, ?, ?, ?, ?)

  def update
   @user = User.find_by(id: params[:id])
   @user.name=params[:name]
   @user.email=params[:email]
   if params[:image]
     @user.image_name="#{@user.id}.jpg"
     image=params[:image]
     File.binwrite("public/user_images/#{@user.image_name}",image.read)
   end
   if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "1.jpg"], ["updated_at", "2020-04-22 09:48:56.497603"], ["id", 1]]

 def destroy
   @user = User.find_by(id: params[:id])
   @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 3]]